Autodesk.Revit.DB.ExternalResourceUtils.IsTypeVisibleIfSourceNotFound(Autodesk.Revit.DB.ExternalResourceType)
Checks whether a given ExternalResourceType is one for which the
host document needs the source file to load.
Remarks:
For CAD links and the keynote table, host document has all the data and it's ok if the file's missing.
For Revit and IFC links, host document can't store all of the info about the link and so
host document needs to find and read the source file in order to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalResourceUtils.IsLowTrustLink(Autodesk.Revit.DB.Element)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalResourceUtils.IsCloudLink(Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.ModelPath)
Checks whether the specified external resource reference points to a cloud model.
pRef:
The external resource reference.
modelPath:
Path to the cloud model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalResourceUtils.IsCloudLink(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.ModelPath)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalResourceUtils.GetAllExternalResourceReferences(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalResourceType)
Gets the ids of all elements which refer to a specific type of external resource.
document:
The Revit Document containing the external resource references.
resourceType:
The type of external resource.
Returns:
The ids of all elements which refer to external resources of the specified type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalResourceUtils.GetAllExternalResourceReferences(Autodesk.Revit.DB.Document)
Gets the ids of all elements which refer to external resources.
Remarks:
This function will not return the ids of nested Revit links;
it only returns top-level references.
document:
The Revit Document containing the external resource references.
Returns:
The ids of all elements which refer to external resources.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015